Repository: soumt-r/Mi.py
Catalog: docs/locale/*/LC_MESSAGES/*.po
Languages: de

source: API Reference
de: API-Referenz

# このセクションではMi.pyのAPIについて説明します
source: This section describes the API of Mi.py
de: In diesem Abschnitt beschreiben wir die API von Mi.py

# このライブラリではloggingを用いてdebug出力が可能です。標準設定では出ないため、起動時の引数として `debug` を渡すようにしてください
source: This library can output `debug` using `logging`. Because it doesn't appear in the standard configuration, you should pass `debug` as an argument at startup.
de: Diese Bibliothek kann `debug` mittels `logging` ausgeben. Sie sollten `debug` als Startargument übergeben, da es in der Standardkonfiguration nicht verfügbar ist.

# イベントリファレンス
source: event reference
de: Referenz des Ereignisses

# botがwebsocketに接続し終えた時点で呼び出されます。
source: It is called when the bot has finished connecting to the websocket.
de: Er wird aufgerufen, wenn der Bot die Verbindung zum Websocket aufgebaut hat.

# ノートが接続しているチャンネル内に投稿された際に呼び出されます
source: Called when a note is posted in the channel you are connected to
de: Wird aufgerufen, wenn in dem Kanal, mit dem Sie verbunden sind, eine Notiz veröffentlicht wird

# 絵文字がインスタンスに追加された際に呼び出されます
source: Called when a pictogram is added to an instance
de: Wird aufgerufen, wenn ein Piktogramm zu einer Instanz hinzugefügt wird

# 抽象基底クラス
source: abstract base class
de: Abstrakte Basisklasse

source: `abstract base class <https://docs.python.org/ja/3/glossary.html#term-abstract-base-class>`_ is a class that can be inherited to get a list of methods etc. Abstract base class can not be instantiated.
de: Abstrakte Basisklasse <https://docs.python.org/ja/3/glossary.html#term-abstract-base-class>`_ ist eine Klasse, die geerbt werden kann, um eine Liste von Methoden usw. zu erhalten. Abstrakte Basisklassen können nicht instanziiert werden.

# Misskey モデル
source: Misskey Models
de: Misskey Modelle

# 下記のクラスは、 **ユーザーによって作成されることを考慮していません** 。 独自のインスタンスは作成するべきではなく、値を変更するべきではありません。
source: The following classes are **not intended to be created by the user**. You should not create your own instances, and you should not modify the values.
de: Die folgenden Klassen sind **nicht dazu bestimmt, vom Benutzer erstellt zu werden**. Sie sollten keine eigenen Instanzen erstellen und die Werte nicht ändern.

source: List[Emoji].
de: Liste[Emoji]

source: Optional[List[str]]
de: Optional[Liste[str]]]

source: Optional[Poll].
de: Optional[Umfrage]

# ノートに対して返信を送信します
source: Sends a reply to the note
de: Senden Sie eine Antwort auf die Notiz

source: Parameters
de: Parameter

# 返信内容
source: reply content
de: Inhalt der Antwort

# 閲覧注意
source: Warning.
de: Warnung

# メンションを展開するか, by default False
source: whether to expand the mention, by default False
de: Ob die Erwähnung erweitert werden soll, standardmäßig False

# ハッシュタグを展開するか, by default False
source: Whether to expand hashtags, by default False
de: Hashtags erweitern, standardmäßig False

# 絵文字を展開するか, by default False
source: Whether to expand pictograms, by default False
de: Ob Emoji erweitert werden sollen, standardmäßig False

# リノート先のid, by default None
source: The id of the renote destination, by default None
de: Die ID des Renote-Ziels, standardmäßig Keine

# チャンネルid, by default None
source: Channel id, by default None
de: Kanal-ID, standardmäßig Keine

# 添付するファイルのid, by default None
source: The id of the file to attach, by default None
de: Die ID der anzuhängenden Datei, standardmäßig None

# アンケート, by default None
source: Survey, by default None
de: Umfrage, standardmäßig None

# ノートの本文にemojiが何個含まれているかを返します
source: Returns the number of emoji in the body of the note.
de: Gibt die Anzahl der Emoji im Text der Notiz zurück

source: Returns
de: Rückgabe

# 含まれている絵文字の数
source: Number of emoji included
de: Anzahl der enthaltenen Emoji

source: Return type
de: Art der Rückgabe

# 成功したか否か
source: Successful or not.
de: Erfolg oder Misserfolg

# ユーザーのid
source: The id of the user
de: Benutzer-ID

# ユーザーのアカウント名
source: User's account name
de: Name des Benutzerkontos

# ユーザーのニックネーム
source: User's nickname
de: Spitzname des Benutzers

# ユーザーのホスト名
source: User's hostname
de: Der Hostname des Benutzers

# ユーザーのアバターのURL
source: The URL of the user's avatar
de: Die URL des Avatars des Benutzers

# ユーザーが管理者かどうか
source: Whether the user is an administrator or not
de: ob der Benutzer ein Administrator ist oder nicht

# ユーザーがbotかどうか
source: Whether the user is a bot or not
de: Ob der Benutzer ein Bot ist oder nicht

# ユーザーが使用しているemoji
source: The emoji the user is using
de: Das vom Benutzer verwendete Emoji

source: list
de: Liste

# ユーザーのオンライン状況
source: User's online status
de: Online-Status des Benutzers

source: any
de: Jede

# ユーザーのプロフィールへのURL
source: URL to the user's profile
de: URL zum Profil des Benutzers

# 謎
source: enigma
de: Geheimnisvoll

# アカウントの作成日
source: Account creation date
de: Datum der Kontoeröffnung

# アカウントの更新日(ノートを投稿するなど)
source: The date your account was updated (e.g. posting a note)
de: Das Datum, an dem Ihr Konto aktualisiert wurde (z. B. durch das Posten einer Notiz)

# アカウントがロックされているか
source: Is your account locked?
de: Ist Ihr Konto gesperrt?

# アカウントがミュートされているか
source: Is your account muted?
de: Ist Ihr Konto stummgeschaltet?

# アカウントが凍結されているか
source: Has your account been frozen?
de: Wurde Ihr Konto eingefroren?

# アカウントの概要
source: Account Overview
de: Kontoübersicht

# ユーザーが住んでいる場所
source: Where the user lives
de: Wohnort des Nutzers

# ユーザーの誕生日
source: User's birthday
de: Geburtstag des Benutzers

# プロフィールのリンクフィールド
source: Link field in profile
de: Link-Feld im Profil

# フォロワーの数
source: Number of Followers
de: Anzahl der Follower

# フォローしている人の数
source: Number of people following you
de: Anzahl der Personen, die Ihnen folgen

# 投稿したノートの数
source: Number of notes you have posted
de: Anzahl der veröffentlichten Notizen

# ピン留めされたノートのidリスト
source: id list of pinned notes
de: Angepinnte Notizen id Liste

# ピン留めされたページのid
source: The id of the pinned page
de: Die ID der angehefteten Seite

# ピン留めされたページ
source: pinned page
de: Angepinnte Seiten

# ノートの投稿範囲
source: Scope of note submissions
de: Umfang der Note Einreichungen

# ユーザーがフォローしているかどうか
source: Whether the user is following you or not
de: Ob der Benutzer Ihnen folgt oder nicht

# ユーザーのことをフォローしているかどうか
source: Whether you are following your users or not.
de: Ob Sie dem Benutzer folgen oder nicht

# ユーザーが自分のことをブロックしているかどうか
source: Whether a user is blocking you or not.
de: Ob ein Benutzer Sie blockiert hat oder nicht

# ユーザーのことをブロックしているかどうか
source: Whether the user is being blocked or not.
de: ob der Benutzer gesperrt ist oder nicht

# ユーザーのことをミュートしているかどうか
source: Whether the user is muted or not.
de: Ob der Benutzer stummgeschaltet ist oder nicht.

# ユーザーのインスタンス
source: User Instances
de: Benutzer-Instanzen

# ユーザーの詳細な情報
source: More information about the user
de: Weitere Informationen über den Benutzer

# ユーザーのプロフィールを取得します
source: Retrieves a user's profile
de: Das Profil eines Benutzers abrufen

# ユーザーのプロフィールオブジェクト
source: The user's profile object
de: Das Profilobjekt des Benutzers

# ユーザーのフォロワー一覧を取得します
source: Gets a list of the user's followers
de: Eine Liste der Follower des Benutzers erhalten

# 前回のフォロワーの続きを取得する場合の起点とするユーザーid
source: The user id to use as the starting point when retrieving the continuation of the previous follower.
de: Die Benutzerkennung, die beim Abrufen der Fortsetzung des letzten Followers als Ausgangspunkt verwendet werden soll.

# 最大何人取得するか, max=100
source: Maximum number of people to retrieve, max=100
de: Maximale Anzahl der abzurufenden Personen, max=100

# 全てのフォロワーを取得するか否か
source: Whether to retrieve all followers or not
de: Ob alle Follower abgerufen werden sollen oder nicht

# ユーザーのフォロワー一覧
source: User's Followers List
de: Liste der Follower des Benutzers

# ユーザー情報だが、一般的に使うか怪しいもの
source: User information, but of dubious general use.
de: Benutzerinformationen, aber von zweifelhaftem allgemeinem Nutzen

# ユーザーのアバターのblurhash
source: User avatar blurhash
de: Benutzer-Avatar blurhash

# ユーザーのアバターの色
source: The color of the user's avatar
de: Farbe des Avatars des Benutzers

# ユーザーの言語
source: User's language
de: Sprache des Benutzers

# チャットオブジェクト
source: chat object
de: Chat-Objekte

# チャットを削除します（チャットの作者である必要があります）
source: Delete the chat (you must be the author of the chat)
de: Einen Chat löschen (Sie müssen der Autor des Chats sein)

# ファイルを削除します。
source: Deletes the file.
de: Löschen Sie die Datei.

# 削除に成功したかどうか
source: Whether the deletion was successful or not.
de: ob die Löschung erfolgreich war oder nicht

# 指定したIDのノートを削除します
source: Deletes the note with the specified ID
de: Löscht die Notiz mit der angegebenen ID

source: * **is_success** (*bool*) -- success or failure * **status_code** (*int*) -- HTTP response status code
de: * **is_success** (*bool*) -- Erfolg oder Fehlschlag * **status_code** (*int*) -- HTTP-Antwortstatuscode

# **is_success** (*bool*) -- 成功したか否か
source: **is_success** (*bool*) -- success or failure
de: **is_success** (*bool*) -- Erfolg oder Misserfolg

# **status_code** (*int*) -- HTTP レスポンスステータスコード
source: **status_code** (*int*) -- HTTP response status code
de: **status_code** (*int*) -- HTTP-Antwortstatuscode

# *str* -- 実行に失敗した際のエラーコード
source: *str* -- Error code when execution fails.
de: *str* -- Fehlercode im Falle eines Ausführungsfehlers

# 与えられたIDのユーザーのフォローを解除します
source: Unfollows the user with the given ID
de: Dem Benutzer mit der angegebenen ID nicht mehr folgen

# フォローを解除したいユーザーのID
source: ID of the user you want to unfollow
de: ID des Benutzers, dem Sie nicht mehr folgen möchten

# データクラス
source: data class
de: Datenklassen

# 例外処理
source: exception handling
de: Behandlung von Ausnahmen

# http アクセス時に404が帰ってきた際の例外
source: Exception when a 404 is returned on http access
de: Ausnahme für 404-Rückgaben bei http-Zugriff

# タスクを停止しようとした際、タスクが起動していない場合に発生する例外
source: Exception thrown when attempting to stop a task and the task is not started.
de: Ausnahme, die beim Versuch, eine Aufgabe anzuhalten, ausgelöst wird, wenn die Aufgabe nicht gestartet wurde

# 私は藍です
source: I'm Indigo.
de: Ich bin Indigo.

# http アクセス時に500が帰ってきた際の例外
source: Exception when 500 is returned on http access
de: Ausnahme, wenn der http-Zugang 500 zurückgibt

source: ClientError
de: ClientFehler

# http アクセス時に400が帰ってきた際の例外
source: Exception when http access returns 400
de: Ausnahme, wenn der http-Zugang 400 zurückgibt

# 認証で問題が発生した際の例外
source: Exceptions in case of authentication problems
de: Ausnahmen im Falle von Authentifizierungsproblemen

# 必須のパラメーターが存在しない場合の例外
source: Exception when a required parameter does not exist
de: Ausnahmen, wenn die erforderlichen Parameter nicht vorhanden sind

# パラメーターが無効
source: Parameter is invalid
de: Ungültiger Parameter

# 認証情報が不足している
source: Authentication information is missing.
de: Authentifizierungsinformationen fehlen

# 送信するコンテンツが不足している
source: Not enough content to send
de: Es gibt nicht genügend Inhalt zum Senden

# cogの名前が重複している
source: Duplicate cog names.
de: Doppelte Cog-Namen

# cogがすでに読み込まれている
source: cog is already loaded.
de: Cog ist bereits geladen

# cog周りのエラー
source: Errors around cog
de: Fehler im Cog

# cogにsetup関数が無い場合の例外
source: Exception when cog does not have a setup function
de: Ausnahme, wenn Cog keine Einrichtungsfunktion hat

# 指定されたパスにcogが存在しない場合の例外
source: Exception if cog does not exist in the specified path
de: Ausnahme, wenn Cog im angegebenen Pfad nicht existiert

# コマンド登録時のエラー
source: Error in command registration
de: Fehler bei der Registrierung von Befehlen

# コマンドで問題が発生した際の例外
source: Exception when a problem occurs with the command
de: Ausnahmen, wenn ein Problem mit einem Befehl auftritt

# コマンドの実行に問題が発生した際の例外
source: Exceptions when there is a problem executing the command
de: Ausnahmen, wenn ein Problem bei der Ausführung eines Befehls auftritt

# コマンドの実行可能かのチェックに失敗した際の例外
source: Exception when the command fails to check if it is executable
de: Ausnahme, wenn der Befehl nicht prüfen kann, ob er ausführbar ist

# cogのパスが不正
source: Incorrect path for cog
de: Falscher Pfad zu Cog

# 必要なデータが存在しない場合に発生する例外
source: Exception raised when the required data does not exist.
de: Ausnahme, die ausgelöst wird, wenn die erforderlichen Daten nicht vorhanden sind

source: Low-Level API
de: Niederschwellige API

source: parse_channel is a function to parse channel event
de: parse_channel ist eine Funktion zum Analysieren von Kanalereignissen

# チャンネルタイプのデータを解析後適切なパーサーに移動させます
source: Move the channel type data to the appropriate parser after analysis
de: Die Daten des Kanaltyps werden analysiert und an den entsprechenden Parser weitergeleitet

source: Received message
de: Empfangene Nachricht

# リプライ
source: reply
de: Antwort

# ユーザーをフォローした際のイベントを解析する関数
source: Function to analyze the event when following a user.
de: Funktion zur Analyse des Ereignisses der Verfolgung eines Benutzers

# フォローイベントを解析する関数
source: Function to parse follow events
de: Funktion zum Parsen von Folgeereignissen

# メンションイベントを解析する関数
source: Function to parse a mention event
de: Funktion zum Parsen eines Erwähnungsereignisses

# チャットが来た際のデータを処理する関数
source: Function to process data when a chat comes in
de: Funktion zur Verarbeitung von Daten, wenn ein Chat empfangen wird

# チャットが既読になっていない場合のデータを処理する関数
source: Function to process data when chat has not been read
de: Funktion zur Verarbeitung von Daten, wenn der Chat nicht gelesen wurde

# 通知イベントを解析する関数
source: Function to parse notification events
de: Funktion zum Parsen von Benachrichtigungsereignissen

# 未読の通知を解析する関数
source: Function to parse unread notifications
de: Funktion zum Parsen ungelesener Benachrichtigungen

# リアクションに関する情報を解析する関数
source: Function to analyze information about reactions
de: Funktion zur Analyse von Informationen über Reaktionen

# ノートイベントを解析する関数
source: Function to parse note events
de: Funktionen zum Parsen von Notizereignissen

# 指定したnoteに指定したリアクションを付与します（内部用
source: Give the specified reaction to the specified note (for internal use).
de: Gibt die angegebene Reaktion auf die angegebene Notiz (für den internen Gebrauch).

# 付与するリアクション名
source: Reaction name to be granted
de: Bezeichnung der zu gewährenden Reaktion

# 付与対象のノートID
source: Note ID to be granted
de: Hinweis zu erteilende ID

# 指定したidのノートを削除します。
source: Deletes the note with the specified id.
de: Löscht die Notiz mit der angegebenen ID

# ノートid
source: note id
de: Anmerkung id

source: Retrieves the user's profile. It accesses the server only once and uses the cache afterwards. If you use fetch_user, the cache is discarded and the server is accessed again.
de: Ruft das Profil des Benutzers ab. Er greift nur einmal auf den Server zu und nutzt danach den Cache. Wenn Sie fetch_user verwenden, wird der Cache verworfen und der Zugriff auf den Server erfolgt erneut.

# 取得したいユーザーのユーザーID
source: User ID of the user you want to retrieve
de: Benutzer-ID des Benutzers, den Sie abrufen möchten

# 取得したいユーザーのユーザー名
source: User name of the user you want to retrieve
de: Der Benutzername des Benutzers, den Sie abrufen möchten

# 取得したいユーザーがいるインスタンスのhost
source: The host of the instance where the user you want to retrieve is located
de: Der Host der Instanz, in der sich der abzurufende Benutzer befindet

# ユーザー情報
source: user information
de: Benutzerinformationen

# チャットを送信します。
source: Send a chat.
de: Senden Sie einen Chat.

# 送信する内容
source: What to send
de: Was zu senden ist

# ユーザーid, default=None
source: User id, default=None
de: Benutzerkennung, default=None

# グループid, default=None
source: Group id, default=None
de: Gruppen-ID, Standard=None

# 添付するファイルid, efault=None
source: File id to attach, efault=None
de: Datei-ID zum Anhängen, efault=None

# チャットの内容
source: Content of the chat
de: Inhalt des Chats

# 指定したidのメッセージを削除します。
source: Deletes the message with the specified id.
de: Löscht die Nachricht mit der angegebenen ID.

# メッセージid
source: message-id
de: Nachrichten-ID

# 与えられたユーザーのフォロワーを取得します
source: Gets the followers for a given user
de: Ruft die Follower eines bestimmten Benutzers ab

# ユーザー名
source: username
de: Name des Benutzers

# ユーザーがいるインスタンスのhost名
source: The host name of the instance the user is in
de: Der Hostname der Instanz, in der sich der Benutzer befindet

# 前回の最後の値を与える(既に実行し取得しきれない場合に使用)
source: Give the last value of the last time (use this if you've already done it and can't get it)
de: Gibt den letzten Wert des vorherigen Laufs an (wird verwendet, wenn der Lauf bereits abgeschlossen wurde und nicht abgerufen werden kann)

# 取得する情報の最大数 max: 100
source: Maximum number of information to retrieve max: 100
de: Anzahl der abzurufenden Informationen, max=100

# 全てのフォロワーを取得する
source: Get All Followers
de: Alle Follower erhalten

source: Yields
de: Treffer

# *dict* -- フォロワーの情報
source: *dict* -- Follower information
de: *dict* -- Follower-Informationen

source: raises
de: Erhöht

# limit引数が不正な場合
source: If the limit argument is invalid
de: Wenn das limit-Argument ungültig ist

# 最大取得数
source: Maximum number of acquisitions
de: Maximale Anzahl von Abrufen

# 既読済みか否か
source: read or unread
de: Schon gelesen oder nicht?
